#include <stdio.h>

/* 这里只需要关注两点：1. 但凡遇到...，那么就和后面的__VA_ARGS__原原本本地一对一替换；
 * 		       2. 双引号里面的双引号可以直接省略，因为如果想在字符串中表示双引号，应当使用\反斜杠
 *
 * 案例解析：对于PR("2+2=%d\n",2+2),一对一替换为 printf("2+2=%d\n",2+2)
 *           对于PR_(1,"2+2=%d\n",2+2),一对以替换为 printf("MESSAGE "1" : " "2+2=%d\n",2+2),删除多余的“，则有printf("MESSAGE 1 : 2+2=%d\n",2+2);
 *		(注：这里的1对应X，首部属于...，所以不应当被归纳入__VA_ARGS__)
 * */


#define PR(...) printf(__VA_ARGS__)
#define PR_(X,...) printf("MESSAGE "#X" : " __VA_ARGS__)

int main()
{
	PR("2+2=%d\n",2+2);
	PR_(1,"2+2=%d\n",2+2);
}
